{
    "Title": "Dungeon of the Future and Past",
    "Credits": "Created by Nicholas Wadsworth (nwadswor@ucsc.edu).",
    "InitialLocation": "Entrance",
    "Locations": {
        "Entrance": {
            "Body": "As an adventurer you live the life of adventure and journey, risk and reward. As you journey, you end up opening up a hole in the ground causing you to fall thunding against the floor. As you groan and look around you find that you have fallen into a dungeon, and an acient one at that. The walls are covered in a slightly glowing moss and vines that hold the bricks in place. If it weren't for the vegetation the dungeon like the hole would have collapsed long ago. You look up through the hole realizing help will not come, at least for a while, you decide the best course of action would be to look around, perhaps for an exit. In front stand two doors, one made of stone and the other made of wood, so adventurer what door do you take?",
            "Choices": [
                {
                    "Text": "Stone Door",
                    "Target": "Rock Room"
                },
                {
                    "Text": "Wood Door",
                    "Target": "Magic Room"
                }
            ]
        },
        "Rock Room": {
            "Body": "As you enter the room you find 6 standing pedistal standing next to another stone door, this one however does not seem eassy to open and can only be opened by sliding upward. Each pedistal made of a different type of stone, one looks like Onyx, another Diorite. It is unclear what to do to open the door. You do however notice that on the pedistals there seems to be a sequence of runes that glow slightly although nothing happens when you touch them. What now?",
            "Choices": [
                {
                    "Text": "Go Back",
                    "Target": "Entrance"
                },
                {
                    "Text": "Examine Runes",
                    "Target": "Rune Clue"
                }
            ],
            "Hidden": [
                {
                    "Text": "Escape",
                    "Target": "Maze Entrance 1"
                }
            ]
        },
        "Rune Clue": {
            "Body": "You examine the runes closely and find that you don't recognize them, they are foreign perhaps of an ancient language. To decipher them would take longer than you have time for. However you commit their shape, order, and sequence to heart.",
            "Choices": [
                {
                    "Text": "Interesting",
                    "Target": "Rock Room"
                }
            ]
        },
        "Magic Room": {
            "Body": "You enter through the wooden door to find what seems more like a more traditional room for a dungeon made out of stone under the earth. The walls are also made out of wood and there isn't much in the room when it comes to furniture or decoration. You find the room covered in runes, nothing you recognize from your studies or from what you have learned on your travels. When you cautiously tap one it glows with a slight purple hue to them, tapping them again turns them off. What you notice is pressing 6 of them turns all of them off giving you pause. You also notice that laying on the floor are several pretty rocks of different material. It is quite mysterious why they lay astrewn the ground especially considering there isn't anything else in the room to denote that someone may have stored them here previously or had left them there. Perhaps it is a code? Perhaps it is simply a riddle? Either way what shall you do?",
            "Choices": [
                {
                    "Text": "Leave",
                    "Target": "Entrance"
                },
                {
                    "Text": "Pick Up the Rocks",
                    "Target": "Rock Item"
                }
            ],
            "Hidden": [
                {
                    "Text": "Escape",
                    "Target": "Maze Entrance 2"
                }
            ]
        },
        "Rock Item": {
            "Body": "You pick up the rocks finding 6 in total, each are made of a differnt stone type but all of them are the same in that they are small, the size of pebbles, and smooth as if polished for a purpose. You place them in your pocket thinking they may be useful",
            "Choices": [
                {
                    "Text": "Interesting",
                    "Target": "Magic Room"
                }
            ]
        },
        "Maze Entrance 1": {
            "Body": "As you look at the stones in your pocket you notice they correspond with the pedistals. You place each rock on the center of it's corresponding pedistal as the runes glow brighter with each correctly identified rock. As you place the last rock, the stone door begins to shift upward revealing a new room. You walk into the room and find that it is different, made from stone but not brick, more like concrete with no discernable cracks. You notice in front stand 3 passages that turn in different directions, one left, straight, and right. Which route do you take?",
            "Choices": [
                {
                    "Text": "Left",
                    "Target": "Pit Trap"
                },
                {
                    "Text": "Straight",
                    "Target": "Arrow"
                },
                {
                    "Text": "Right",
                    "Target": "Dead End 1"
                }
            ]
        },
        "Maze Entrance 2": {
            "Body": "As you remember the runes on the wall, you recall the order and remember the sequence was only 6 runes. You swiftly press each rune in the corresponding order watching as they glow with the purple hue and as you get the code correctly they glow brighter, enveloping the room in it's blinding light. As you open your eyes again, you notice you are in a new location, seperate of the one you were at before. Here the walls are stone again but they are not constructed of bricks like before. It looks more like concrete but there are no openings in the stone. In front of you stand 3 entryways, each leading a different direction as you look down them. Left, Straight, or Right?",
            "Choices": [
                {
                    "Text": "Left",
                    "Target": "Dead End 2"
                },
                {
                    "Text": "Straight",
                    "Target": "Rune"
                },
                {
                    "Text": "Right",
                    "Target": "Air Trap"
                }
            ]
        },
        "Pit Trap": {
            "Body": "You walk down the left corridor, taking a couple turns and it leads you to a room where there seems to be nothing inside although it hard to see everything without walking fully into the room. Do you wish to walk in? Turn around and take a different route?",
            "Choices": [
                {
                    "Text": "Turn Around",
                    "Target": "Maze Entrance 1"
                },
                {
                    "Text": "Go Deeper",
                    "Target": "Fall"
                }
            ]
        },
        "Air Trap": {
            "Body": "You walk down the right corridor, after walking for a bit you come upon an empty room for the most part. You look inside and see a rune on the opposite wall faintly glowing. You go in and touch it or you want to just turn back?",
            "Choices": [
                {
                    "Text": "Turn Back",
                    "Target": "Maze Entrance 2"
                },
                {
                    "Text": "Touch the Rune",
                    "Target": "Suffocate"
                }
            ]
        },
        "Dead End 1": {
            "Body": "You follow the corridor for a ways before suddenly coming to a wall in front of you. Seems you hit a dead end, guess you have to trek your way back.",
            "Choices": [
                {
                    "Text": "Trek Back",
                    "Target": "Maze Entrance 1"
                }
            ]
        },
        "Dead End 2": {
            "Body": "You follow the corridor for a ways before suddenly coming to a wall in front of you. Seems you hit a dead end, guess you have to trek your way back.",
            "Choices": [
                {
                    "Text": "Trek Back",
                    "Target": "Maze Entrance 2"
                }
            ]
        },
        "Arrow": {
            "Body": "As you walk down the corridor for a while you notice that there are wooden signs posted. The sign has an arrow on it and you decide to follow it causiously. As you begin to follow one arrow it leads to another sign with another arrow on it. Do you choose to keep following these arrows? They seem trustworthy thus far, or do you just turn back and take a differnt route?",
            "Choices": [
                {
                    "Text": "Go Back",
                    "Target": "Maze Entrance 1"
                },
                {
                    "Text": "Follow the Arrows",
                    "Target": "Outside 1"
                }
            ]
        },
        "Rune": {
            "Body": "You walk down the center corridor, following it for a ways before coming upon a wall. You assume it's a dead end before you look and see that there is a rune on the wall. It glows faintly indicating there is some magic on it but not sure what that magic would do. Do you risk it and touch the rune or just turn back and look for a different route?",
            "Choices": [
                {
                    "Text": "Go back",
                    "Target": "Maze Entrance 2"
                },
                {
                    "Text": "Touch the Rune",
                    "Target": "Outside 2"
                }
            ]
        },
        "Fall": {
            "Body": "As you step deeper into the room, you feel the floor begin to rumble familiarly. However it is too late as the floor falls in on itself. You stare down into the abyss as you get impaled by spikes at the bottom of the pit quickly and swiftly killing you. Leaving your body down there forever to rot without anyone finding you."
        },
        "Suffocate": {
            "Body": "As you reach out your hand to touch the rune, quickly the purple light consumes the room once more. As you are teleported to another room, this room has no windows, no doors, nothing, just pure concrete with no cracks. Your lungs begin to burn as you realize there is no oxygen in here, finally noticing all of the skeletons around you, panic sets in. Freaking out as you run out of air, your muscles losing strength as you finally sit on the ground accepting your fate, closing your eyes. You die becoming one of the many skeletons to litter the floor of this room"
        },
        "Outside 1": {
            "Body": "You decide to trust the arrows, following them causiously, still worried of a threat being at the end. As you walk you notice a light quickly running towards it. As you see the outside grass and meadow. As you exit you breathe in the fresh air and feel the sun on your skin. You turn around to see the exit but where a great dungeon once stood now there is nothing. You question whether there ever was a dungeon as you realize, you left your stuff back at the camp."
        },
        "Outside 2": {
            "Body": "You touch the rune, extending your hand out you watch as that purple light envelops you once more but as you open your eyes you notice that you are now outside, any signs of the dungeon no where to be seen. You search yourself to make sure you have all your stuff but realize that you left everything back at the camp you were at and worse of all...you have no idea where you were teleported out at."
        }
    }
}